{
	"no" : {
		"name" : [
			"へし切長谷部",
			"山姥切国広",
			"太郎太刀",
			"蛍丸",
			"和泉守兼定",
			"鶴丸国永",
			"浦岛虎彻",
			"三日月宗近",
			"本丸",
			"大和守安定",
			"蜂须贺虎彻"
		],
		"text" : [
			"带上他去战斗吧！(*￣∇￣*)",
			"肝到天亮都值得！（握拳",
			"这张脸我能舔一万年！(/≥▽≤/)",
			"有了你，就是我的一発入魂！",
			"婶婶们啊！下一次掉落率一定增加！",
			"日日听你喝哈到天明！www",
			"距离我的刀男后宫又进了一步！(≡ω≡．)",
			"此生不悔入刀剑坑惹！_(:3 」∠)_",
			"难道非审的春天就要来了?！(*ﾟ▽ﾟ*)",
			"我我我这是要移民欧洲的节奏呀！ww"
		]
	},
	"yes" : {
		"name" : [
			"3ds怪物猎人限定版",
			"山姥切国広",
			"太郎太刀",
			"蛍丸",
			"和泉守兼定",
			"鶴丸国永",
			"浦岛虎彻",
			"三日月宗近",
			"本丸",
			"大和守安定",
			"蜂须贺虎彻"
		]
	}


	
}